In [1]:
import os
import pandas as pd
import matplotlib.pyplot as plt
from collections import Counter
from itertools import chain

pd.set_option('display.max_columns', None)

This is a silly exercise to do some exploration and data cleaning of the NYC-MTA station metadata, which is associated with the turnstile usage data.

In [45]:
df_station = pd.read_excel('http://web.mta.info/developers/resources/nyct/turnstile/Remote-Booth-Station.xls')
df_station['Line Name'] = df_station['Line Name'].map(str) ## Convert integer to string for stations with only number lines
df_station.head()

  Remote  Booth       Station Line Name Division
0   R001   A060  WHITEHALL ST        R1      BMT
1   R001   A058  WHITEHALL ST        R1      BMT
2   R001  R101S   SOUTH FERRY        R1      IRT
3   R002   A077     FULTON ST  ACJZ2345      BMT
4   R002   A081     FULTON ST  ACJZ2345      BMT

The *Line Name* column contains each of the train lines that serves the station. NYC Metro lines are characterized just by a single character, so taking the first row with Whitehall Street station as an example there are the __R__ and __1__ lines. 

I'll do a simple calculation of how many stations each line serves based on this dataset. However, even in the first 5 rows you can see that there are duplicates in terms of station name and line name. The data will also be subsetted by the major divisions BMT, IRT, and IND.

In [47]:
df_station_only = df_station[df_station['Division'].isin(['BMT', 'IND', 'IRT'])][['Station', 'Line Name']].drop_duplicates()

## Counting the number of stations per Line
df_line = pd.Series([item for sublist in df_station_only['Line Name'].map(lambda x: list(str(x))) for item in sublist])
df_line.groupby(df_line).count().rename_axis('Line Name').reset_index(name='Count').set_index('Line Name').T

Line Name,1,2,3,4,5,6,7,A,B,C,D,E,F,G,J,L,M,N,Q,R,S,Z
Count,50,63,48,41,57,47,26,55,50,49,45,32,52,24,35,30,43,42,43,56,14,25

The __1__ line seems to have too many station counts. It should be 38 stations according to Wikipedia. Let's see what's going on here.

In [6]:
df_station_only[df_station_only['Line Name'].str.contains('1')]

             Station    Line Name
0       WHITEHALL ST           R1
2        SOUTH FERRY           R1
14   42 ST-PA BUS TE  ACENQRS1237
67       CHAMBERS ST          123
68    34 ST-PENN STA          123
72    42 ST-TIMES SQ  1237ACENQRS
74    42 ST-TIMES SQ  ACENQRS1237
81            125 ST            1
82   168 ST-BROADWAY          1AC
84   168 ST-BROADWAY          AC1
85        DYCKMAN ST            1
86            207 ST            1
87            215 ST            1
88   MARBLE HILL-225            1
89            231 ST            1
160   59 ST-COLUMBUS        1ABCD
162   59 ST-COLUMBUS        ABCD1
193            14 ST       123FLM
216            50 ST            1
218           242 ST            1
290  116 ST-COLUMBIA            1
295      14 ST-6 AVE       FLM123
296            6 AVE       FLM123
300    66 ST-LINCOLN            1
304            79 ST            1
306            86 ST            1
309            96 ST          123
311  137 ST-CITY COL            1
351   CHRISTOPHER ST            1
353            23 ST            1
355           103 ST            1
356  110 ST-CATHEDRL            1
358           157 ST            1
462           181 ST            1
480            28 ST            1
482           145 ST            1
484           191 ST            1
506       HOUSTON ST            1
513   34 ST-PENN STA       123ACE
528        RECTOR ST            1
530     CORTLANDT ST            1
534           238 ST            1
550         CANAL ST            1
552            18 ST            1
585      FRANKLIN ST            1
666  NYC & CO - 7 AV            1
718            72 ST          123
736  METROCARD VAN-1            1
737  METROCARD VAN-2            1
738  METROCARD VAN-3            1

Lots of issues here that's causing duplications. There are entries where the station names are the same but the lines are not in order which the `drop_duplicates()` did not pick up. Even worse, _34 ST-PENN STA_ have entries _ACE_ and _123ACE_. 

There are also station names that have _METROCARD_ which probably just needs to be filtered out.

There are also duplicate stations like _42 ST-PA BUS TE_ and _42 ST-TIMES SQ_ which are the same building complex. These will be manually filtered out.

In [52]:
df_station_only = df_station[df_station['Division'].isin(['BMT', 'IND', 'IRT'])][['Station', 'Line Name']]

## Concatenate all line name for every unique station name. 
df_station_only = df_station_only.groupby(['Station'])['Line Name'].apply(lambda x: ''.join(x)).reset_index()

## Create a set, convert back to list and then to return a string for unique list of lines by station name
df_station_only['Line Name'] = df_station_only['Line Name'].map(lambda x: ''.join(list(set(x))))

## Unfortunate addtional filtering needed...
df_station_only = df_station_only[~df_station_only['Station'].str.contains('METROCARD')]
duplicate_station_list = ['42 ST-PA BUS TE', '6 AVE', '14 ST-6 AVE']
df_station_only = df_station_only[~df_station_only['Station'].isin(duplicate_station_list)]
df_station_only

             Station   Line Name
0              1 AVE           L
1             103 ST        1BC6
2      103 ST-CORONA           7
3             104 ST          JZ
4             110 ST           6
5    110 ST-CATHEDRL           1
6         110 ST-CPN          32
7             111 ST          7J
8             116 ST       B2C63
9    116 ST-COLUMBIA           1
10            121 ST          JZ
11            125 ST  1DB452C63A
12            135 ST        3B2C
13   137 ST-CITY COL           1
14      138 ST-3 AVE           6
15    138 ST-GR CONC          45
16             14 ST   1FL2C3EMA
18    14 ST-UNION SQ     4N5LQ6R
19            145 ST      1DBC3A
20      148 ST-LENOX           3
21      149 ST-3 AVE          52
22    149 ST-GR CONC         452
23    15 ST-PROSPECT          GF
24            155 ST         DBC
25            157 ST           1
26     161 ST-YANKEE         DB4
27   163 ST-AMSTERDM           C
28            167 ST         DB4
29   168 ST-BROADWAY         1AC
30            169 ST           F
..               ...         ...
340        SPRING ST         6EC
341  ST LAWRENCE AVE           6
342      STEINWAY ST          MR
343      STERLING ST          52
344    STILLWELL AVE        NDFQ
345     SUTPHIN BLVD        FJZE
346       SUTTER AVE          3L
347      TREMONT AVE          DB
348         UNION ST           R
349  UNION TPK-KEW G          FE
350        UTICA AVE          AC
351  VAN ALSTON-21ST           G
352   VAN SICLEN AVE        J3ZC
353    VAN WYCK BLVD          FE
354   VERNON/JACKSON           7
355   W 4 ST-WASH SQ     DBFCEMA
356  W 8 ST-AQUARIUM          FQ
357    WAKEFIELD-241           2
358          WALL ST        4352
359  WASHINGTON-36 A          NQ
360   WESTCHESTER SQ           6
361     WHITEHALL ST          1R
362     WHITLOCK AVE           6
363       WILSON AVE           L
364      WINTHROP ST          52
365   WOODHAVEN BLVD        MJZR
366    WOODLAWN ROAD           4
367  WORLD TRADE CTR       2C3EA
368          YORK ST           F
369       ZEREGA AVE           6

[362 rows x 2 columns]

Looks good, except there are some stations that have the same name but completely different stations. _14 ST_ is one such example. But for the sake of counting the number of stations served by Line this is ok.

In [50]:
## Alternate way using chain and Counter
pd.Series(Counter(chain(*df_station_only['Line Name']))).rename_axis('Line Name').reset_index(name='Count').set_index('Line Name').T

Line Name,1,2,3,4,5,6,7,A,B,C,D,E,F,G,J,L,M,N,Q,R,S,Z
Count,40,52,37,33,48,43,24,49,47,43,42,29,50,24,32,25,40,36,38,48,11,22

Does not quite match the 38 count for the __1__ line but getting quite close.